## 4.6 	使用DataFrame存取器

In [9]:
import pandas as pd
import numpy as np

###  4.6.1 	使用DataFrame存取器loc[]

In [2]:
data = {
    'apples': [3, 2, 0, 1], 
    'oranges': [0, 1, 2, 3],
    'bananas': [1, 2, 1, 0]
}
df = pd.DataFrame(data, index=['June','Robert','Lily','David'])
df

        apples  oranges  bananas
June         3        0        1
Robert       2        1        2
Lily         0        2        1
David        1        3        0

In [3]:
df.loc['David', 'apples']

1

In [4]:
df.loc[['David','Robert'], 'apples']

David     1
Robert    2
Name: apples, dtype: int64

In [6]:
type(df.loc['David', 'apples'])

numpy.int64

In [7]:
b = [True, False, True, False]
df.loc[b, 'apples']

June    3
Lily    0
Name: apples, dtype: int64

In [8]:
df.loc[b, 'apples':]

      apples  oranges  bananas
June       3        0        1
Lily       0        2        1

### 4.6.2 	使用DataFrame存取器iloc[]

In [10]:
df.iloc[3, 0]

1

In [11]:
df.iloc[[3, 1], 0]

David     1
Robert    2
Name: apples, dtype: int64

In [12]:
b = [True, False, True, False]

In [13]:
df.iloc[b, 0]

June    3
Lily    0
Name: apples, dtype: int64

In [14]:
df.iloc[b, 0:]

      apples  oranges  bananas
June       3        0        1
Lily       0        2        1

In [15]:
df.iloc[:, 0:2]

        apples  oranges
June         3        0
Robert       2        1
Lily         0        2
David        1        3

In [16]:
df.iloc[1:3, 0:2]

        apples  oranges
Robert       2        1
Lily         0        2

### 4.6.3 	使用DataFrame存取器at[]和iat[]

In [17]:
df.at['Robert', 'apples']

2

In [18]:
df.iat[1, 0]

2